## Plan Result (prod_app_registrations - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * module.this.azuread_application_federated_identity_credential.this[&#34;DTS Recipe Receiver testing-repo:hmcts/recipe-receiver:pull_request&#34;]
  * module.this.azurerm_role_assignment.this[&#34;Sandbox Cleanup-Contributor-/subscriptions/0c1744f8-9e63-4742-9c28-c066fd2e6eee&#34;]
  * module.this.azurerm_role_assignment.this[&#34;Sandbox Cleanup-Contributor-/subscriptions/5709598c-3a1c-4535-8979-f10948b9a031&#34;]
* Delete
  * module.this.azuread_application_federated_identity_credential.this[&#34;DTS Recipe Receiver testing-repo:hmcts/recipe-receiver:ref:pull_request&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.this.azuread_application_federated_identity_credential.this["DTS Recipe Receiver testing-repo:hmcts/recipe-receiver:pull_request"] will be created
  + resource "azuread_application_federated_identity_credential" "this" {
      + application_object_id = "45214b74-e9e3-476e-8355-fff839e8a996"
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + display_name          = "repo_hmcts__recipe-receiver_pull_request"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:hmcts/recipe-receiver:pull_request"
    }

  # module.this.azuread_application_federated_identity_credential.this["DTS Recipe Receiver testing-repo:hmcts/recipe-receiver:ref:pull_request"] will be destroyed
  # (because key ["DTS Recipe Receiver testing-repo:hmcts/recipe-receiver:ref:pull_request"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "this" {
      - application_object_id = "45214b74-e9e3-476e-8355-fff839e8a996" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "0dca4f57-1c3d-40a6-88e4-9794ad924da9" -> null
      - display_name          = "repo_hmcts__recipe-receiver_ref_pull_request" -> null
      - id                    = "45214b74-e9e3-476e-8355-fff839e8a996/federatedIdentityCredential/0dca4f57-1c3d-40a6-88e4-9794ad924da9" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:hmcts/recipe-receiver:ref:pull_request" -> null
    }

  # module.this.azurerm_role_assignment.this["Sandbox Cleanup-Contributor-/subscriptions/0c1744f8-9e63-4742-9c28-c066fd2e6eee"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c0579ea1-0637-4b45-bb30-c760c4cbe3e4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/0c1744f8-9e63-4742-9c28-c066fd2e6eee"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["Sandbox Cleanup-Contributor-/subscriptions/5709598c-3a1c-4535-8979-f10948b9a031"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c0579ea1-0637-4b45-bb30-c760c4cbe3e4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/5709598c-3a1c-4535-8979-f10948b9a031"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 3 to add, 0 to change, 1 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.this.azuread_application.this["DTS Recipe Receiver testing"] has changed
  ~ resource "azuread_application" "this" {
      + group_membership_claims        = []
        id                             = "45214b74-e9e3-476e-8355-fff839e8a996"
      + identifier_uris                = []
        tags                           = []
        # (13 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.this.azuread_service_principal.this["DTS Recipe Receiver testing"] has changed
  ~ resource "azuread_service_principal" "this" {
      + alternative_names            = []
        id                           = "ee16a4e6-dc33-4270-bffe-85515a2a6ccb"
      + notification_email_addresses = []
        tags                         = []
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



## :warning: Errors

* add a label prod_app_registrations - TerraformPlanApply/destroy: POST https://api.github.com/repos/hmcts/azure-github-federation-config/issues/70/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":70,"Program":"tfcmt","SHA1":"","Target":"prod_app_registrations - TerraformPlanApply","Vars":{}} -->